# IFC_SetProperty

## Description
Sets the specified property value.

```pascal
FUNCTION IFC_SetProperty(
				hObject      : HANDLE;
				pSetName     : STRING;
				propertyName : STRING;
				propValue    : STRING) : BOOLEAN;
```

```python

def vs.IFC_SetProperty(hObject, pSetName, propertyName, propValue):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|pSetName|STRING||
|propertyName|STRING||
|propValue|STRING||

## Version
Availability: from Vectorworks 2018
## Category
* IFC